
import { ChartNetwork, ChartSpline, DollarSign, Home, Info, Mail ,Glasses, Pin, Rocket, Star} from "lucide-react";
import { FaFacebookF, FaInstagram, FaTiktok } from "react-icons/fa6";

export const PHONE = "01015058614"
export const BASE_URL = "https://nourborsa.com"
export const headerData = [
    { title: "الرئيسية", link: "/", icon: Home },
    { title: "الاسهم", link: "/stocks", icon:ChartNetwork   },
    { title: "Nour AI", link: "/nour-ai", icon:ChartNetwork   },
    { title: "الخدمات", link: "/our-services", icon: ChartSpline },
    { title: "الاشتركات", link: "/pricing", icon: DollarSign },
    { title: "من نحن", link: "/about-us", icon: Info },
    { title: "تواصل معنا", link: "/contact-us", icon: Mail },
]

export const FAQLIST =[
    {question:"هل الاستثمار في البورصة حلال أم حرام؟", answer: `
 البورصة في حد ذاتها حلال، لأنها سوق لتنظيم بيع وشراء حصص في شركات حقيقية
الحكم الشرعي لا يكون على البورصة نفسها ولكن على
		نشاط الشركة
	   وطريقة تعاملها المالي`},
    {question:"ما الهدف من هذا الموقع؟", answer:`  الموقع يهدف إلى مساعدة المستثمر المسلم على معرفة هل السهم متوافق مع أحكام الشريعة الإسلامية أم لا، مع توضيح نسبة التطهير وتقديم معلومات مالية مبسطة تساعده على اتخاذ قرار استثماري واعي 
   `},
    {question:"ما الفرق بين الأسهم النقية والمختلطة؟", answer:`
        هي أسهم شركات
		نشاطها الأساسي مباح
		لا تتعامل بالربا لا إقراضًا ولا اقتراضًا
		ولا تحقق إيرادات محرمة

    حكمها الشرعي
جائزة بلا خلاف، ولا تحتاج إلى تطهير

ما هي الأسهم المختلطة؟

هي أسهم شركات
		نشاطها الأساسي مباح
		لكنها تتعامل بجزء من معاملاتها بالربا
(مثل قروض بنكية أو ودائع بفائدة)
		أو لديها إيرادات جانبية محرمة بنسبة قليلة

 حكمها الشرعي
جائزة بشروط، مع وجوب التطهير

        `},
    {question:"متى يكون الاستثمار في الأسهم حرامًا؟", answer:`
        يكون حرامًا إذا
		كان نشاط الشركة الأساسي محرمًا (مثل الخمور، القمار ، الربا والتي يقع فيها معظم الشركات)
		أو كان السهم قائمًا أساسًا على معاملات ربوية بحتة        
        `},
        {question:'كيف تحددون هل السهم حلال أم حرام؟', answer:`
            يتم التقييم بناءً على
		نشاط الشركة الأساسي
		نسبة الإيرادات المحرمة إن وُجدت
		هيكل القروض والفوائد
		الأصول السائلة
		الإيداعات الربوية
وذلك وفقًا للضوابط الشرعية المعمول بها من هيئة المراجعة و المحاسبة للمؤسسات المالية الإسلامية
هل يمكن أن يتغير حكم السهم؟

نعم
حكم السهم قد يتغير إذا تغيرت القوائم المالية أو نشاط الشركة، لذلك يتم التحديث بشكل دوري

ماذا لو كان نشاط الشركة حلال لكن لديها قروض ربوية؟

في هذه الحالة يكون السهم
مختلط
جائز بشرط عدم بلوغ نسبتها 30% من اجمالي الأصول 
مع وجوب التطهير بنسبة محددة
            
            `},
        {question:" ما هي نسبة التطهير؟", answer:`
            هي النسبة التي يجب إخراجها من الأموال للتخلص من الإيرادات غير المتوافقة مع الشريعة التي دخلت على الشركة
            
            `},
                {
                    question:'هل الخدمة مناسبة للمضارب أم المستثمر طويل الأجل؟',answer:`
                     مناسبة للطرفين، لأن الحكم الشرعي ونسبة التطهير مبنيان  علي مبادئ تناسب المضارب و المستثمر 
                    `

                }
    ]
   

    export const ABOUTUS =`نحن فريق متخصص في البحث و مراجعة الأسهم لكي يساعد المستثمر من أخذ قراراته المالية السليمة و المتوافقة مع القيم الإسلامية بسهولة 
و نهتم بتقديم معلومات دقيقة جدا و مراجعتها مع التحديث الفوري لأي معلومات .`
    export const OurServiceData = [
    {
        title: "١.تفاصيل شرعية وتطهير الارباح",
    
      description: `توضيح معلومات الأسهم الشرعية بحيث و هل متوافقة مع شروط اللجان الشرعية المعتمدة ام لا 
مع تقديم حلول سهلة وبسيطة في حساب مبالغ التطهير التي يلزم علي الفرد أخرجها `,
      icon:Star,
    },
    {
        title: "٢.معلومات مالية",
        description:`نساعدك في توضيح  ارقام الشركة المالية المهمة بشكل بسيط وموثوق بعيدا عن الحسابات الكثيرة و المعقدة
والتي تساعدك في اتخاذ قرارات مالية سليمة`,
        icon:Glasses        
    },
    {
        title: "٣.ذكاء اصطناعي ",
        description:`مساعدتك
نطور نموذج  ذكاء اصطناعي قادر علي مساعدتك في تحليل المؤشرات و الاتجاهات الفنية للسهم ونعمل علي تطويره لاعلي مستوي`,
        icon:Rocket
    }
]          

export const SOCIALCARDS =[
    {icon:FaFacebookF, url:'/'},
    {icon:FaInstagram, url:'/'},
    {icon:FaTiktok, url:'/'},
]